In [ ]:
# Installing required packages
#!pip install ipython-sql
# For python2
#!pip install MySQL-python
# For python3
#!pip install pymysql

In [1]:
# Loading SQL into the notebook
%load_ext sql

In [2]:
# Only for python3
try:
    import pymysql
    pymysql.install_as_MySQLdb()
except ImportError:
    pass

In [3]:
# Connecting to SQL - Make sure the local server is running
# database_lab is the DB Name
%sql mysql://root:@localhost/database_lab

'Connected: root@database_lab'

# Application Software Development Lab
## 1. Familiarization of DDL Statements.
## 2. Familiarinzation of DML Statements.
## 3. Implement relationship between database - one to one, one to many, many to many.  
- **One to One**  
Both tables have only one record on either side of the relationship. Each primary key value relates to one or no record in the related table.

In [ ]:
%%sql
# Creating the tables
CREATE TABLE student(id INT PRIMARY KEY, name VARCHAR(20), class VARCHAR(10));
CREATE TABLE stud_details(id INT PRIMARY KEY, stud_id INT, dob VARCHAR(10), address VARCHAR(20), FOREIGN KEY(stud_id) REFERENCES student(id));

In [ ]:
%%sql
# Inserting data into tables
INSERT INTO student VALUES(1, "Adarsh", "CSB");
INSERT INTO student VALUES(2, "Augustine", "CSB");
INSERT INTO student VALUES(3, "Jishnu", "CSB");
INSERT INTO stud_details VALUES(1, 1, "21/10/1998", "abc");
INSERT INTO stud_details VALUES(2, 2, "31/8/1998", "def");
INSERT INTO stud_details VALUES(3, 3, "1/1/1998", "pqr");

In [17]:
%%sql
SELECT s.id, s.name, d.dob, d.address FROM student s, stud_details d where s.id = d.stud_id;

   mysql://root:***@localhost
 * mysql://root:***@localhost/database_lab
3 rows affected.

[(1, 'Adarsh', '21/10/1998', 'abc'),
 (2, 'Augustine', '31/8/1998', 'def'),
 (3, 'Jishnu', '1/1/1998', 'pqr')]

- **One to Many**
Single record in one table related to multiple records in another table.

In [ ]:
%%sql
# Creating table
CREATE TABLE project(id INT PRIMARY KEY, stud_id INT, name VARCHAR(20), description VARCHAR(50), FOREIGN KEY(stud_id) REFERENCES student(id));

In [ ]:
%%sql
# Inserting data
INSERT INTO project VALUES(100, 1, "abc", "abcdef");
INSERT INTO project VALUES(101, 1, "pqr", "pqrst");
INSERT INTO project VALUES(102, 2, "def", "defgh");

In [22]:
%%sql
SELECT s.name, p.name, p.description FROM student s, project p WHERE s.id = p.stud_id;

   mysql://root:***@localhost
 * mysql://root:***@localhost/database_lab
3 rows affected.

[('Adarsh', 'abc', 'abcdef'),
 ('Adarsh', 'pqr', 'pqrst'),
 ('Augustine', 'def', 'defgh')]

- **Many to Many**
Many records in a table can link to many records in another table.

In [ ]:
%%sql
# Creating table
CREATE TABLE course(id INT PRIMARY KEY, code VARCHAR(10));
CREATE TABLE stud_course(stud_id INT, course_id INT, FOREIGN KEY(stud_id) REFERENCES student(id), FOREIGN KEY(course_id) REFERENCES course(id));

In [ ]:
%%sql
# Inserting data
INSERT INTO course VALUES(1, "CS101");
INSERT INTO course VALUES(2, "MA201");
INSERT INTO course VALUES(3, "CS205");
INSERT INTO stud_course VALUES(1, 1);
INSERT INTO stud_course VALUES(1, 2);
INSERT INTO stud_course VALUES(1, 3);
INSERT INTO stud_course VALUES(2, 1);
INSERT INTO stud_course VALUES(2, 3);
INSERT INTO stud_course VALUES(3, 2);

In [10]:
%%sql
SELECT s.id, s.name, c.code FROM student s, course c, stud_course s_c WHERE s.id = s_c.stud_id AND c.id = s_c.course_id;

 * mysql://root:***@localhost/database_lab
6 rows affected.

[(1, 'Adarsh', 'CS101'),
 (1, 'Adarsh', 'MA201'),
 (1, 'Adarsh', 'CS205'),
 (2, 'Augustine', 'CS101'),
 (2, 'Augustine', 'CS205'),
 (3, 'Jishnu', 'MA201')]

## 4. Create a database to set various constraints.  
Commonly used constraints are: 
- **NOT NULL** - Column cannot have null values
- **UNIQUE** - Ensures all values in column are different
- **PRIMARY KEY** - Uniquely identifies each row in a table
- **FOREIGN KEY** - Uniquely identifies a row/record in another table 
- **CHECK** - Ensures all values in a column satisfies a specific condition
- **DEFAULT** - Sets default value for a column
- **INDEX** - Used to create and retrieve data from table very quickly

In [ ]:
%%sql
CREATE TABLE const_test(id INT PRIMARY KEY, name VARCHAR(20) UNIQUE, class VARCHAR(10) NOT NULL, year INT DEFAULT 1, age INT CHECK(age>17));

## 5. Implementation of Views and Assertions.
**VIEWS** - Views are virtual tables. We can create a view using CREATE VIEW statement.

In [ ]:
%%sql
CREATE VIEW student_course AS SELECT s.id, s.name, c.code FROM student s, course c, stud_course s_c WHERE s.id = s_c.stud_id AND c.id = s_c.course_id;

In [16]:
%%sql
SELECT * FROM student_course;

 * mysql://root:***@localhost/database_lab
6 rows affected.

[(1, 'Adarsh', 'CS101'),
 (1, 'Adarsh', 'MA201'),
 (1, 'Adarsh', 'CS205'),
 (2, 'Augustine', 'CS101'),
 (2, 'Augustine', 'CS205'),
 (3, 'Jishnu', 'MA201')]

**ASSERTION** - It is a statement that ensures a certain condition will always exist in the database.

In [ ]:
%%sql
CREATE ASSERTION student_age CHECK ((SELECT count(*) FROM student WHERE class='CSB') < 60);

## 6. Implementation of Build Functions in RDBMS (include numeric funciton, string function,  date and time function).
**NUMERIC FUNCTIONS**  
- ABS - returns absolute value of a number  
- FLOOR - returns the largest integer that is equal to or less than a number
- RAND - returns a random number, or random number within a range
- SQRT - returns the square root of a number
- EXP - returns e raised to the power of a number

In [14]:
%%sql
SELECT ABS(-11.4), FLOOR(10.2), RAND(), SQRT(2), EXP(2);

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(Decimal('11.4'), 10, 0.6208563685611416, 1.4142135623730951, 7.38905609893065)]

**STRING FUNCTIONS**  
- CONCAT - concatenates two or more strings together
- LENGTH - returns length of a specific string
- LOWER - converts a string to lower case
- UPPER - converts a string to upper case
- REVERSE - reverses a string

In [22]:
%%sql
SELECT CONCAT("hello", "world"), LENGTH("abcd"), LOWER("Abcd"), UPPER("Abcd"), REVERSE("abcd");

 * mysql://root:***@localhost/database_lab
1 rows affected.

[('helloworld', 4, 'abcd', 'ABCD', 'dcba')]

**DATE AND TIME FUNCTIONS**
- CURRENT TIMESTAMP - returns the current date and time
- DATEADD - returns a date after a certain date/time interval has been added
- DAY - returns the day of a month for a given date
- UTC_TIMESTAMP - returns current UTC date and time
- YEAR - returns the year for the given date

In [35]:
%%sql
SELECT CURRENT_TIMESTAMP(), DATE_ADD("2018-01-01", INTERVAL 10 DAY), DAY("1998-10-21"), UTC_TIMESTAMP(), YEAR("1998-10-21");

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(datetime.datetime(2018, 9, 5, 23, 49, 4), '2018-01-11', 21, datetime.datetime(2018, 9, 5, 18, 19, 4), 1998)]

## 7. Implementation of various aggregate functions in SQL.

In [ ]:
%%sql
CREATE TABLE marks(stud_id INT, total INT, FOREIGN KEY(stud_id) REFERENCES student(id));
INSERT INTO marks VALUES(1, 80);
INSERT INTO marks VALUES(2, 90);
INSERT INTO marks VALUES(3, 70);

- AVG - to find the average

In [29]:
%%sql
SELECT AVG(total) FROM marks;

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(Decimal('80.0000'),)]

- COUNT - to count the specified rows

In [31]:
%%sql
SELECT COUNT(*) FROM marks;

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(3,)]

- MIN - find the minimum value

In [32]:
%%sql
SELECT MIN(total) FROM marks;

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(70,)]

- MAX - find the maximum value

In [33]:
%%sql
SELECT MAX(total) FROM marks;

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(90,)]

- SUM - find the sum of values

In [34]:
%%sql
SELECT SUM(total) FROM marks

 * mysql://root:***@localhost/database_lab
1 rows affected.

[(Decimal('240'),)]

## 8. Implementation of order by, group by and having clause.  
**ORDER BY** - used to display the output of a query in ascending or descending order

In [35]:
%%sql
SELECT * FROM marks ORDER BY total DESC;

 * mysql://root:***@localhost/database_lab
3 rows affected.

[(2, 90), (1, 80), (3, 70)]

**GROUP BY** - used to perform an operation on a group of records

In [51]:
%%sql
SELECT c.code, COUNT(s_c.stud_id) FROM course c, stud_course s_c WHERE c.id = s_c.course_id GROUP BY c.id;

 * mysql://root:***@localhost/database_lab
3 rows affected.

[('CS101', 2), ('MA201', 2), ('CS205', 2)]

**HAVING** - A filter on groups of rows

In [52]:
%%sql
SELECT c.code, COUNT(s_c.stud_id) FROM course c, stud_course s_c WHERE c.id = s_c.course_id GROUP BY c.id HAVING c.code LIKE 'CS%';

 * mysql://root:***@localhost/database_lab
2 rows affected.

[('CS101', 2), ('CS205', 2)]

## 9. Implementation of set operators (UNION, UNION ALL. INTERSECT, MINUS), nested queries and join queries (CROSS JOIN, INNER JOIN, OUTER JOIN, LEFT JOIN, RIGHT JOIN)

**UNION** - merges result of two SELECT statements. Returns only unique values.

In [58]:
%%sql
SELECT * FROM marks WHERE stud_id <= 2 UNION SELECT * FROM marks WHERE total > 70;

 * mysql://root:***@localhost/database_lab
2 rows affected.

[(1, 80), (2, 90)]

**UNION ALL** - same as union, but shows duplicate values also

**INTERSECT** - Returns rows which two queries have in common

In [62]:
%%sql
SELECT * FROM marks WHERE stud_id < 2 MINUS  SELECT * FROM marks WHERE total > 75;

 * mysql://root:***@localhost/database_lab
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'MINUS  SELECT * FROM marks WHERE total > 75' at line 1") [SQL: 'SELECT * FROM marks WHERE stud_id < 2 MINUS  SELECT * FROM marks WHERE total > 75;']

In [65]:
%%sql
SELECT * FROM marks m LEFT JOIN stud_course s_c ON m.stud_id = s_c.stud_id;
SELECT * FROM marks m RIGHT JOIN stud_course s_c ON m.stud_id = s_c.stud_id;

 * mysql://root:***@localhost/database_lab
6 rows affected.

[(1, 80, 1, 1),
 (1, 80, 1, 2),
 (1, 80, 1, 3),
 (2, 90, 2, 1),
 (2, 90, 2, 3),
 (3, 70, 3, 2)]

In [71]:
%%sql
SELECT * FROM marks m INNER JOIN stud_course s_c ON m.stud_id = s_c.stud_id;

 * mysql://root:***@localhost/database_lab
6 rows affected.

[(1, 80, 1, 1),
 (1, 80, 1, 2),
 (1, 80, 1, 3),
 (2, 90, 2, 1),
 (2, 90, 2, 3),
 (3, 70, 3, 2)]

# 13. Implementation of Procedures & Functions

In [5]:
%%sql
DELIMITER //
CREATE PROCEDURE test 
BEGIN
    SELECT * FROM marks;
END //
DELIMITER;

 * mysql://root:***@localhost/database_lab
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'DELIMITER //\nCREATE PROCEDURE test \nBEGIN\n    SELECT * FROM marks;\nEND //\nDELIMI' at line 1") [SQL: 'DELIMITER //\nCREATE PROCEDURE test \nBEGIN\n    SELECT * FROM marks;\nEND //\nDELIMITER;']